/* 
১. setTimeout এর ভিতরে একটা কিছু কনসোল লগ করবে যেটা সাড়ে তিন সেকেন্ড পরে আউটপুট দেখাবে। ,
*/
// setTimeout(() => console.log("Hello from the other side of the world"), 3500);

/* 
২. prompt দিয়ে ইউজারের কাছ থেকে একটা সংখ্যা নাও। সেটার সাথে ২০০যোগ করো। 
যোগ করতে গেলে parse করা লাগলে সেটা করো। তারপর সেই রেজাল্টকে alert দিয়ে আউটপুট দেখাও 
*/

const callPromt = () => {
  let number = prompt("please enter your number 😒");
  number = parseInt(number) + 200;
  alert(`jaw 200 extra diye dilam ${number} 👌`);
};
// callPromt();
/* 

৩. ব্রাউজারে একটা confirm করে জিজ্ঞেস করো তুমি কি তোমার ওয়েবসাইট এর লোকেশন দেখতে চাও।
 যদি বলে দেখতে চাই তাহলে সেই ওয়েবসাইট এর লোকেশন এর href জিনিসটা কনসোল লগ করে দেখাও 
*/
const dekhbaAmarURL = () => {
  const dekhba = confirm("Wanna see my HREF ? 😎");
  dekhba ? console.log(location.href) : console.log("😒");
};
// dekhbaAmarURL();

/* 
৪. Cookies কি জিনিস। এইটা দিয়ে কি করা হয়। সেটা ইংরেজিতে ৫ থেকে ৭ লাইনের মধ্যে লিখে ফেলো। 
*/

// Check HTML

/* 

৫. local storage আর session storage এর মধ্যে তিনটা পার্থক্য লিখে ফেলো। 
ইংরেজিতে। (নিজের মতো করে লিখবে )
*/
// check HTML
/* 

[হোম ওয়ার্ক] 

৬. জাভাস্ক্রিপ্ট এর কোড কিভাবে ব্রাউজারের মধ্যে রান করে।
 দরকার হলে গুগল বা ইউটিউবে সার্চ দিয়ে একটু ভালো করে দেখে রাখো। 

৭. জাভাস্ক্রিপ্ট এর কোন কোন জিনিস asynchronous সেটার একটা লিষ্ট গুগলে সার্চ দিয়ে বের করে ফেলো। 
    এবং এই asynchronous বলতে কি বুঝায় সেটাও দেখে রাখো। 

৮. event loop লুপ কি জিনিস। এই রিলেটেড পুরা জিনিসটা আজকে অনেকেই বুঝবে না।
 তাও আরেকবার দেখে রাখবে। 

[ চ্যালেঞ্জ ]

৯. ভিডিওতে চারটা লেভেল এর লোকাল স্টোরেজ রিলেটেড কাজ দেয়া হয়েছে।
 সেগুলা একটু ভালো করে করো। 

[মাস্ট করতেই হবে]

১০. stackoverflow নামে একটা ওয়েবসাইট আছে। সেখানে গিয়ে একাউণ্ট খুলবে।
 এবং মিনিমাম ৩০ মিনিট সেখানে স্পেন্ড করবে। দেখবে কিভাবে কি উত্তর দেয়। 

*/
